#
#

# 入出力例

=begin
数値を半角スペース埋めで出力 (paizaランク D 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/stdout_primer/stdout_primer__print_width_step1
問題文のURLをコピーする
 下記の問題をプログラミングしてみよう！
自然数 N が与えられます。N が 3 けたになるよう数値の前に半角スペースを埋めて出力してください。

▼　下記解答欄にコードを記入してみよう

入力される値
N

入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
答えの数値を解答の形式に従った形で出力してください。


N


末尾に改行を入れ、余計な文字、空行を含んではいけません。
条件
すべてのテストケースにおいて、以下の条件をみたします。

* N は自然数
* N は 0 以上 999 以下

入力例1
12

出力例1
12

入力例2
0

出力例2
0
=end